In [1]:
import numpy as np 
import pandas as pd

In [2]:
df1 = pd.DataFrame() 
df2 = pd.DataFrame()

In [3]:
df1['viewers'] = ["Sushmita", "Aditya", "Bala", "Anurag"] 
df2['users'] = ["Aditya", "Anurag", "Bala", "Sushmita", "Apoorva"]

In [4]:
np.random.seed(1729)
df1 = df1.assign(views = np.random.normal(100, 100, 4))
df2 = df2.assign(cost = [20, np.nan, 15, 2, 7])

In [5]:
df1.head()

    viewers       views
0  Sushmita   31.266056
1    Aditya   17.900529
2      Bala  265.236086
3    Anurag   42.470696

In [6]:
df2.head()

      users  cost
0    Aditya  20.0
1    Anurag   NaN
2      Bala  15.0
3  Sushmita   2.0
4   Apoorva   7.0

In [7]:
df = df1.merge(df2, left_on="viewers", right_on="users", how="left")
df.head()

    viewers       views     users  cost
0  Sushmita   31.266056  Sushmita   2.0
1    Aditya   17.900529    Aditya  20.0
2      Bala  265.236086      Bala  15.0
3    Anurag   42.470696    Anurag   NaN

In [8]:
df.fillna(df.mean())

    viewers       views     users       cost
0  Sushmita   31.266056  Sushmita   2.000000
1    Aditya   17.900529    Aditya  20.000000
2      Bala  265.236086      Bala  15.000000
3    Anurag   42.470696    Anurag  12.333333